
#ifndef __GEN_H
#define __GEN_H

#include <stdbool.h>
#include <lpc_types.h>

#include "device.h"
#include "dev_param.h"

//*************************************************************************************************
// Функции управления
//*************************************************************************************************
void GenInit( void );
void GenStart( void );
void GenStop( void );
void GenTest( void );
void GenAutoOnce( void );

//*************************************************************************************************
// Функции статуса/состояния
//*************************************************************************************************
bool GenCycleStart( void );

#endif
