
#ifndef __INVETER_H
#define __INVETER_H

#include "device.h"
#include "dev_param.h"

//*************************************************************************************************
// Функции управления
//*************************************************************************************************
void InvInit( void );
void InvStartup( void );
void InvCtrl( Device dev, InvCtrlCmnd mode );

//*************************************************************************************************
// Функции статуса/состояния
//*************************************************************************************************
BatStatus InvBatConn( Device dev );

#endif 
