
#ifndef __HMI_CAN_H
#define __HMI_CAN_H

#include <stdint.h>
#include <stdbool.h>

#include "device.h"
#include "dev_param.h"

//*************************************************************************************************
// Функции управления
//*************************************************************************************************
void CANInit( void );
void CANSendFrame( uint32_t can_id, uint8_t *ptr_data, uint8_t len_data );

//*************************************************************************************************
// Функции статуса/состояния
//*************************************************************************************************
ValueParam HmiGetValue( ParamHmi id_param );

#endif
