
//*************************************************************************************************
//
// Массив текстовых сообщений
//
//*************************************************************************************************

#include <stdio.h>
#include <stdint.h>

#include "device.h"
#include "dev_param.h"

#include "can_def.h"
#include "events.h"
#include "message.h"

//*************************************************************************************************
// Cообщения консоли
//*************************************************************************************************
static char * const cons_msg[] = { 
    ">",                                                        //CONS_MSG_PROMPT
    "#",                                                        //CONS_MSG_PROMPT2
    "OK\r\n",                                                   //CONS_MSG_OK
    "\r\n",                                                     //CONS_MSG_CRLF
    "Неверная команда.\r\n",                                    //CONS_MSG_ERR_CMND
    "Команда не выполняется из планировщика.\r\n",              //CONS_MSG_ERR_NOJOB
    "Неверный параметр.\r\n",                                   //CONS_MSG_ERR_PARAM
    "Параметр(ы) не указан.\r\n",                               //CONS_MSG_ERR_NOPARAM
    "Устройства нет в сети.\r\n",                               //CONS_MSG_ERR_NODEV
    "Ошибка передачи.\r\n",                                     //CONS_MSG_ERR_SEND
    "Имя файла не указано.\r\n",                                //CONS_MSG_ERR_NONAME
    "Ошибка открытия файла.\r\n",                               //CONS_MSG_ERR_FOPEN
    "Недостаточно параметров.\r\n",                             //CONS_MSG_ERR_NOTENPAR
    "Недопустимое значение параметров.\r\n",                    //CONS_MSG_ERR_VALUE
    "Ошибка: %s\r\n",                                           //CONS_MSG_ERR_DESC
    "Контроллер не подключен.\r\n",                             //CONS_MSG_ERR_NOLINK
    "Загрузка файла экрана: %s ... ",                           //CONS_MSG_LOAD_SCREEN
    "Загрузка файла заданий: %s ... ",                          //CONS_MSG_FILE_JOBS
    "Превышение лимита строк.\r\n",                             //CONS_MSG_ERR_LIMITSTR
    "Задание не указано.\r\n",                                  //CONS_MSG_ERR_JOB
    "Временный файл: jobs~ не открывается.\r\n",                //CONS_MSG_ERR_JOB_OPEN
    "Временный файл: jobs~ не переименован.\r\n",               //CONS_MSG_ERR_JOB_RENAME
    "!!! Превышение лимита строк (байт) !!!\r\n",               //CONS_MSG_ERR_JOB_BYTE
    "Файл: ",                                                   //CONS_MSG_FILE
    " не удален.\r\n",                                          //CONS_MSG_NOT_DELETED
    " не открывается.\r\n",                                     //CONS_MSG_NOT_OPEN
    "  Превышение размера буфера.",                             //CONS_ERR_BUFF_FULL
    "От полного заряда АКБ прошло только: %u дней\r\n",         //CONS_MSG_CHARGE_DAY
    "====================================================================\r\n", //CONS_MSG_JOB_HDR1
    "        ..........1.........2.........3.........4.........5.........\r\n", //CONS_MSG_JOB_HDR2
    "        012345678901234567890123456789012345678901234567890123456789\r\n", //CONS_MSG_JOB_HDR3
    "--------------------------------------------------------------------\r\n", //CONS_MSG_JOB_HDR4
    //CONS_MSG_HEADER
    "------------------------------------------------------------------------------------------------------\r\n",
    "\r\n   Name thread     Priority  State      Stack Unused\r\n", //CONS_MSG_TASK_HDR1
    "----------------------------------------------------\r\n",     //CONS_MSG_TASK_HDR2
                                                                //CONS_MSG_MPPT_HEADER1
    "                    00 01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52\r\n",
                                                                //CONS_MSG_MPPT_HEADER2
    "                    --------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n",
                                                                //CONS_MSG_MPPT_HEADER3
    "                    xx xx xx xx ----- ----- ----- ----- -- ----- ----- xx xx ?? ?? ?? ?? ----- ?? -- ----- ?? ?? ?? ?? ?? xx xx xx ----------- ----------- ----- ----- xx xx xx xx\r\n",
                                                                //CONS_MSG_MPPT_HEADER4
    "                                00003 00001 00004 00013 12 00015 00011                   Time     08 00014                         000000005_2 000000005_1 00007 00017            \r\n",
                                                                //CONS_MSG_MPPT_HEADER5
    "                    ==============================================================================================================================================================\r\n",
    "Application version ......... %s\r\n",                     //CONS_MSG_APP_VER
    "Build version ............... %s %s\r\n",                  //CONS_MSG_BUILD_VER
    "CPU clock ................... %s Hz\r\n",                  //CONS_MSG_CPU_CLOCK
    "Clock periphery ............. %s Hz\r\n",                  //CONS_MSG_CLOCK_PER
    "Clock of the kernel tick .... %s Hz\r\n",                  //CONS_MSG_CLOCK_KERNEL
    "Clock of the system timer ... %s Hz\r\n",                  //CONS_MSG_CLOCK_SYSTIMER
    "Kernel information .......... %s\r\n",                     //CONS_MSG_KERNEL_INFO
    "Kernel version .............. %s\r\n",                     //CONS_MSG_KERNEL_VER
    "Kernel API version .......... %s\r\n",                     //CONS_MSG_KERNEL_API
    //CONS_MSG_MODBUS_ERR
    "Modbus protocol errors                    Total    Trc  Voice  Meteo    Gen  Dev05  Dev06  Dev07  Dev08\r\n"
 };

//*************************************************************************************************
// Сообщения функционала работы с SD картой
//*************************************************************************************************
static char * const sd_msg[] = { 
    "SD карта не доступна.\r\n",                                //MSG_SD_NO
    "SD карта смонтирована.\r\n",                               //MSG_SD_MOUNT
    "Метка SD карты: %s\r\n",                                   //MSG_SD_LABEL
    "Серийный номер SD карты: %X\r\n",                          //MSG_SD_SERIAL
    "Ошибка доступа к метке диска.\r\n",                        //MSG_SD_ERR_LABEL
    //
    "Размонтирование SD карты - OK.\r\n",                       //MSG_SD_UNMOUNT_OK
    "Размонтирование SD карты уже выполнено.\r\n",              //MSG_SD_UNMOUNT_EXEC
    "Ошибка монтирования SD карты, код: %d\r\n",                //MSG_SD_ERR_MOUNT
    "Ошибка размонтирования SD карты.\r\n",                     //MSG_SD_ERR_UNMOUNT
    //
    "Инициализация файловой системы ...\r\n",                   //MSG_SD_FSYS_INIT
    "На SD карте нет файловой системы.\r\n",                    //MSG_SD_FSYS_NOSYS
    "Ошибка инициализации файловой системы.\r\n",               //MSG_SD_FSYS_ERR_INIT
    "Размонтирование файловой системы - OK.\r\n",               //MSG_SD_FSYS_UNMOUNT
    "Ошибка размонтирование файловой системы.\r\n",             //MSG_SD_FSYS_ERR_UNMOUNT
    //
    " ID производителя: %d (0x%.2X)\r\n",                       //MSG_SD_ID_VENDOR
    "           OEM ID: %c%c\r\n",                              //MSG_SD_OEMID
    "     Имя продукта: %c%c%c%c%c\r\n",                        //MSG_SD_NAMEPROD
    " Ревизия продукта: %d.%d\r\n",                             //MSG_SD_REVISION
    "   Серийный номер: 0x%X\r\n",                              //MSG_SD_SERIAL2
    "Дата производства: %d/%.2d\r\n",                           //MSG_SD_DATE
    "Ошибка чтения CID регистра.\r\n",                          //MSG_SD_ERR_CID
    "Драйвер %s не существует.\r\n",                            //MSG_SD_NODRIVER
    //
    "Файл удален.\r\n",                                         //MSG_FILE_DELETED
    "Файл не найден.\r\n",                                      //MSG_FILE_NOT_FOUND
    "Ошибка удаления файла.\r\n",                               //MSG_FILE_ERR_DELETED
    //
    "Каталог удален.\r\n",                                      //MSG_DIR_DEL
    "Каталог не найден.\r\n",                                   //MSG_DIR_DEL_NFOUND
    "Ошибка удаления Каталога.\r\n",                            //MSG_DIR_ERR_DEL
    //
    "Файл переименован.\r\n",                                   //MSG_FILE_RENAME
    "Ошибка переименования файла.\r\n",                         //MSG_FILE_ERR_RENAME
    //
    "Список файлов M0: ",                                       //MSG_DIR
    "%-41s    <Каталог>  ",                                     //MSG_DIR_NAME     
    "%9d файлов  %21s байт\r\n",                                //MSG_DIR_CNT_FILES
    "%9d Каталогов   %21s байт доступно\r\n",                   //MSG_DIR_CNT_BYTE 
    "%56s байт доступно\r\n",                                   //MSG_DIR_FREE     
    "Файлов нет.\r\n",                                          //MSG_DIR_NO_FILE
    //
    "Файл: %s не открывается.\r\n",                             //MSG_FT_NOT_OPEN
    "\r\n<Конец файла>\r\n",                                    //MSG_FT_EOF
    "\r\nФайл: %s\r\n",                                         //MSG_FT_FPAGE
                                                                //MSG_FT_HEADER_HEX
    "------------00-01-02-03-04-05-06-07--08-09-0A-0B-0C-0D-0E-0F--0123456789ABCDEF------------------------\r\n\r\n"
 };

//*************************************************************************************************
// Сообщения для файлов логирования событий
//*************************************************************************************************
static char * const log_msg[] = { 
    //АВР
    "Нагрузка подключается к основной сети",                    //LOG_MSG_PWR_AC
    "Нагрузка подключается к инверторам",                       //LOG_MSG_PWR_INV
    "Основная сеть восстановлена",                              //LOG_MSG_AC_RESTORE
    "Основная сеть отключена",                                  //LOG_MSG_AC_DISCON
    //контроль SOC
    "Низкий заряд АКБ, подзарядка от основной сети",            //LOG_MSG_SOC_BAT_CHRG_AC
    "Низкий заряд АКБ, подзарядка от генератора",               //LOG_MSG_SOC_BAT_CHRG_GEN
    "Низкий заряд АКБ, запуск генератора",                      //LOG_MSG_SOC_GEN_START
    "Подзарядка от основной сети",                              //LOG_MSG_SOC_CHRG_AC
    "Подзарядка от генератора",                                 //LOG_MSG_SOC_CHRG_GEN
    //панели
    "Солнечные панели подключены",                              //LOG_MSG_PV_ON
    "Солнечные панели отключены",                               //LOG_MSG_PV_OFF
    "Параллельное соединение панелей",                          //LOG_MSG_PV_PAR
    "Последовательное соединение панелей",                      //LOG_MSG_PV_SER
    "Ошибка включения панелей",                                 //LOG_MSG_PV_ONERR
    "Ошибка отключения панелей",                                //LOG_MSG_PV_OFFERR
    //трекер
    "Управление актуаторами включено",                          //LOG_MSG_ACT_ON
    "Управление актуаторами выключено",                         //LOG_MSG_ACT_OFF
    "Включен командный режим",                                  //LOG_MSG_TRC_CMD
    "Выключен командный режим",                                 //LOG_MSG_TRC_SUN
    //контроллер заряда
    "Управление. Включение заряда",                             //LOG_MSG_CHRG_START
    "Управление. Выключение заряда",                            //LOG_MSG_CHRG_STOP
    "Восстановление. Включение заряда",                         //LOG_MSG_CHRG_RSTART
    "Зарядка АКБ завершена по току",                            //LOG_MSG_CHRG_END1
    "Зарядка АКБ завершена",                                    //LOG_MSG_CHRG_END2
    //инверторы
    "TS-1000-224",                                              //LOG_MSG_INV1
    "TS-3000-224",                                              //LOG_MSG_INV2
    "TS-1000-224 ... OK",                                       //LOG_MSG_INV1_OK
    "TS-3000-224 ... OK",                                       //LOG_MSG_INV2_OK
    "Включение TS-1000-224",                                    //LOG_MSG_INV1_TURN_ON
    "Выключение TS-1000-224",                                   //LOG_MSG_INV1_SHDN
    "Включение TS-3000-224",                                    //LOG_MSG_INV2_TURN_ON
    "Выключение TS-3000-224",                                   //LOG_MSG_INV2_SHDN
    "TS-1000-224 включен",                                      //LOG_MSG_INV1_ON
    "TS-3000-224 включен",                                      //LOG_MSG_INV2_ON
    "Ручное включение TS-1000-224",                             //LOG_MSG_INV1_MAN_ON
    "Ручное выключение TS-1000-224",                            //LOG_MSG_INV1_MAN_OFF
    "Ручное включение TS-3000-224",                             //LOG_MSG_INV2_MAN_ON
    "Ручное выключение TS-3000-224",                            //LOG_MSG_INV2_MAN_OFF
    "TS-1000-224 выключен",                                     //LOG_MSG_INV1_OFF
    "TS-3000-224 выключен",                                     //LOG_MSG_INV2_OFF
    "Управление контакторов выключено, проверим инвертор",      //LOG_MSG_INV_CTRL_DC_OFF
    "Управление контакторов включено",                          //LOG_MSG_INV_CTRL_DC_ON
    "Выключен удаленно, включаем программно",                   //LOG_MSG_INV_RMTOFF_SWON
    "Контактор включен",                                        //LOG_MSG_INV_DC_ON
    "Выключаем контактор",                                      //LOG_MSG_INV_DC_SHDN
    "Чтение конфигурации",                                      //LOG_MSG_INV_RD_CONF
    "Чтение состояния",                                         //LOG_MSG_INV_RD_STAT
    "Выключаем командой",                                       //LOG_MSG_INV_OFF_CMD
    "Выключен удаленно",                                        //LOG_MSG_INV_OFF_RMT
    "Инвертор выключен, контактор не выключился",               //LOG_MSG_INV_DC_OFF_ERR
    "На инверторе включена нагрузка"                            //LOG_MSG_INV_POWER_AC
 };                                                               

//*************************************************************************************************
// Информация о командах
//*************************************************************************************************
const static char help[] = {
    "?                                      - справка\r\n"
    "TIME [hh:mi[:ss]]                      - чтение/установка времени\r\n"
    "DATE [dd.mm.yyyy]                      - чтение/установка даты\r\n"
    "DTIME                                  - дата-время в полном формате\r\n"
    "MOUNT                                  - смонтировать SD карту\r\n"
    "UNMOUNT                                - размонтировать SD карту\r\n"
    "CONFIG [load/save/clr/id value]        - загрузка/сохранение/сброс/присвоение значения параметру\r\n"
    "SCR                                    - перезагрузка шаблона экрана в память\r\n"
    "DIR [*.*]                              - вывод списка фалов SD карты\r\n"
    "TYPE filename                          - просмотр текстового файла\r\n"
    "HEX filename                           - просмотр файла в формате HEX\r\n"
    "DEL name                               - удаление файла\r\n"
    "DIRDEL name                            - удаление каталога\r\n"
    "REN name new_name                      - переименование файла\r\n"
    "FILE name                              - создание текстового файла с данными введенными из консоли, ESC-конец ввода\r\n"
    "CID                                    - информация о SD карте\r\n"
    "EEPROM [n 0-63/clr 0-63]               - дамп памяти EEPROM/очистка блока памяти\r\n"
    "STATALL                                - состояние входов\r\n\r\n"
    "HMI                                    - вывод состояния интерфейса обмена данными с HMI\r\n"
    "CMD filename                           - выполнение пакетного файла с командами\r\n"
    "JOBS [add/del/on/off/run/load n [all]] - просмотр/управление заданиями\r\n"
    "\r\n"
    "BATMON                                 - данные монитора батареи\r\n"
    "INV 1/2 on/off                         - состояние/управление инверторами\r\n"
    "ALT [ac/dc]                            - состояние АВР, принудительное переключение нагрузки\r\n"
    "PV [on/off/par/ser]                    - управление коммутацией солнечных панелей\r\n"
    "MPPT                                   - состояние конроллера MPPT\r\n"
    "CHARGE [0/2/3/8 [days]]                - управление зарядкой от сети AC, days - запуск если от последнего заряда > N дней\r\n"
    "\r\n"
    "TRC [on/off]                           - управление реле питания цепей актуаторов\r\n"
    "TRC [ver/hor value]                    - управление позиционированием трекера, целое значение value в мм, с дес. точкой в град\r\n"
    "TRC [save/rest/stop]                   - сохранить/восстановить положение в EEPROM\r\n"
    "TRC [reset/cmd/int/stop/init]          - перезапуск, вкл командный режим, вкл внутреннее управление, прервать позиционирование, перевод в нач. положение\r\n"
    "GEN [start/stop/test]                  - управление генератором\r\n"
    "SPA                                    - параметры восхода/захода солнца\r\n"
    "RES 0/1/2/3 on/off/pulse               - управление дополнительными реле\r\n"
    "EXT up/dn/lf/rt on/off/pulse           - управление дополнительными выходами\r\n"
    "VOICE 1...N [name_voice]               - воспроизведение голосового сообщения\r\n"
    "VOLUME 0...N                           - установка уровня громкости голосового сообщения\r\n"
    "SOUND 1...N [name]                     - воспроизведение звукового сообщения\r\n"
    "MODBUS dev func reg cnt data1..5       - отправка команды по MODBUS (формат параметров: HEX без 0x))\r\n"
    "MODERR                                 - вывод статистики ошибок MODBUS\r\n"
    "MODLOG 0/1                             - логирование запрос/ответ MODBUS\r\n"
    "RESET                                  - перезапуск контроллера\r\n"
    "TASK                                   - вывод списка задач\r\n"
    "SYSTEM                                 - вывод системной информации\r\n"
    "[] - необязательный параметр\r\n"
 };

//*************************************************************************************************
// Возвращает указатель на строку текстового сообщения
// ConsMesage id_mess - ID сообщения
// return             - указатель на строку
//*************************************************************************************************
char *Message( ConsMessage id_mess ) {

    if ( id_mess < SIZE_ARRAY( cons_msg ) )
        return cons_msg[id_mess];
    else return NULL;
 }

//*************************************************************************************************
// Возвращает указатель на строку текстового сообщения
// По CAN шине передает сообщение содержащее ID события для логирования на стороне HMI контроллера
// LogMessId id_mess - ID сообщения
// return            - указатель на строку
//*************************************************************************************************
char *MessageLog( Device dev, LogMessId id_mess ) {

    uint32_t msg;
    
    if ( id_mess < SIZE_ARRAY( log_msg ) ) {
        if ( dev != ID_DEV_NULL ) {
            msg = CAN_DEV_ID( ID_DEV_LOG ) | CAN_PARAM_ID( dev ) | id_mess;
            osMessageQueuePut( hmi_msg, &msg, 0, 0 );
           }
        return log_msg[id_mess];
       }
    else return NULL;
 }

//*************************************************************************************************
// Возвращает указатель на строку текстового сообщения
// LogMessId id_mess - ID сообщения
// return            - указатель на строку
//*************************************************************************************************
char *MessageSd( SdMessId id_mess ) {

    if ( id_mess < SIZE_ARRAY( sd_msg ) )
        return sd_msg[id_mess];
    else return NULL;
 }

//*************************************************************************************************
// Возвращает указатель на строку с описанием команд
//*************************************************************************************************
char *MessageHelp( void ) {

    return (char *)help;
 }

