
#ifndef __OUTINFO_H
#define __OUTINFO_H

#include <stdint.h>
#include <stdbool.h>

typedef enum {
    TEMPLATE_OFF,                           //Вывод шаблона выключен
    TEMPLATE_OUT                            //Вывод шаблона включен
 } TemplateOut;

//*************************************************************************************************
// Функции управления
//*************************************************************************************************
void ScreenInit( void );
void ScreenLoad( void );
void ChangeModeOut( void );

//*************************************************************************************************
// Функции статуса/состояния
//*************************************************************************************************
TemplateOut OutDataStat( void );

#endif
