
//*************************************************************************************************
// Определение масок и регистров MODBUS для отслеживания состояния и управления генератором
//*************************************************************************************************

#ifndef __GEN_EXT_H
#define __GEN_EXT_H

//*************************************************************************************************
// Адреса регистров чтения контроллера генератора
//*************************************************************************************************
#define EXGEN_REG_RD_MODE       0x0000                  //регистр текущего режима: выкл/запуск/работа/отдых
#define EXGEN_REG_RD_STAT       0x0001                  //регистр текущего состояния, в т.ч. ошибки 
#define EXGEN_REG_RD_ERROR      0x0002                  //регистр текущих ошибок генератора
#define EXGEN_REG_RD_RUN        0x0003                  //регистр времени работы
#define EXGEN_REG_RD_RUND       0x0004                  //регистр времени работы до выключения
#define EXGEN_REG_RD_LOST       0x0005                  //регистр времени до начала запуска при отключении основной сети
#define EXGEN_REG_RD_REST       0x0006                  //регистр времени до выключения генератора при восстановлении основной сети
#define EXGEN_REG_RD_SLEEP      0x0007                  //регистр времени до окончания отдыха

#define EXGEN_REG_RD_MAX_BASE   EXGEN_REG_RD_SLEEP + 1 //максимальное кол-во регистров чтения основного состояния

//*************************************************************************************************
// Адреса дополнительных регистров чтения контроллера генератора
//*************************************************************************************************
#define EXGEN_REG_RD_DLY_START  0x0008                  //регистр задержки запуска генератора после отключения основной сети (sec)
#define EXGEN_REG_RD_DLY_STOP   0x0009                  //регистр задержки выключения генератора после восстановления основной сети (sec)
#define EXGEN_REG_RD_TIME_RUN   0x000A                  //регистр максимальной продолжительность работы генератора (sec)
#define EXGEN_REG_RD_TIME_SLEEP 0x000B                  //регистр продолжительности паузы между длительными работами (sec)
#define EXGEN_REG_RD_CNT_START  0x000C                  //регистр кол-ва попыток запуска генератора

#define EXGEN_REG_RD_MAX        EXGEN_REG_RD_CNT_START + 1 //максимальное кол-во регистров чтения

//*************************************************************************************************
// Адреса регистров записи
//*************************************************************************************************
#define EXGEN_REG_WR_CMD        0x0000                  //регистр команд управления
#define EXGEN_REG_WR_DLY_START  0x0001                  //регистр задержки запуска генератора после отключения основной сети (sec)
#define EXGEN_REG_WR_DLY_STOP   0x0002                  //регистр задержки выключения генератора после восстановления основной сети (sec)
#define EXGEN_REG_WR_TIME_RUN   0x0003                  //регистр максимальной продолжительность работы генератора (sec)
#define EXGEN_REG_WR_TIME_SLEEP 0x0004                  //регистр продолжительности паузы между длительными работами (sec)
#define EXGEN_REG_WR_CNT_START  0x0005                  //регистр кол-ва попыток запуска генератора
#define EXGEN_REG_WR_MAX        EXGEN_REG_WR_CNT_START + 1 //максимальное кол-во регистров для записи

#define EXGEN_MODE_AUTO         0x8000                  //признак автоматического режима

//*************************************************************************************************
// Маски команд для управления генератором
//*************************************************************************************************
#define EXGEN_CMD_START         0x0001                  //запуск генератора
#define EXGEN_CMD_TEST          0x0002                  //тестовый запуск генератора
#define EXGEN_CMD_STOP          0x0004                  //останов генератора
#define EXGEN_CMD_AUTO          0x0010                  //включить автоматический режим работы
#define EXGEN_CMD_MANUAL        0x0020                  //выключить автоматический режим работы
#define EXGEN_RESET             0x8000                  //перезапуск контроллера генератора

//*************************************************************************************************
// Маски источника сброса контроллера
//*************************************************************************************************
#define EXGEN_PWR_RES           0x0100                  //Power-on Reset
#define EXGEN_EXT_RES           0x0200                  //External Reset
#define EXGEN_BRN_RES           0x0400                  //Brown-Out Reset
#define EXGEN_WDT_RES           0x0800                  //Watchdog Reset

#endif
