
//*************************************************************************************************
// Определение масок и регистров MODBUS для отслеживания состояния и управления генератором
//*************************************************************************************************

#ifndef __MERCURY_EXT_H
#define __MERCURY_EXT_H

#include "gen_all.h"

//*************************************************************************************************
// Адреса регистров чтения для контроллера счетчика Mercury 200.2
//*************************************************************************************************
#define EXMER_REG_RD_STAT       0x0000                  //регистр источника сброса
#define EXMER_REG_RD_CURRENT    0x0001                  //регистр мгновенного значения тока
#define EXMER_REG_RD_VOLTAGE    0x0002                  //регистр мгновенного значения напряжения
#define EXMER_REG_RD_POWER      0x0003                  //регистр мгновенного значения мощности
#define EXMER_REG_RD_TARIFF1    0x0004                  //регистр общего расхода по тарифу "день"
#define EXMER_REG_RD_TARIFF2    0x0005                  //регистр общего расхода по тарифу "ночь"

#define EXMER_REG_RD_MAX        EXMER_REG_RD_TARIFF2 + 1 //максимальное кол-во регистров чтения

//*************************************************************************************************
// Маски источника сброса контроллера счетчика Mercury 200.2
//*************************************************************************************************
#define STAT_EPC_PORRST         0x0001                  //сброс от схемы POR
#define STAT_EPC_PINRST         0x0002                  //сброс внешним сигналом
#define STAT_EPC_SFTRST         0x0004                  //программный сброс
#define STAT_EPC_WDTRST         0x0008                  //сброс по таймеру WDT


#endif
