
//*************************************************************************************************
// Определение масок и регистров MODBUS для отслеживания состояния и управления
// солнечным трекером
//*************************************************************************************************

#ifndef __TRACKER_EXT_H
#define __TRACKER_EXT_H

//*************************************************************************************************
//Адреса регистров чтения
//*************************************************************************************************
#define EXTRC_REG_RD_STAT   0x0000      //регистр статуса см. ниже "маски ..."
#define EXTRC_REG_RD_VERT   0x0001      //регистр текущего вертикального положения (в мм)
#define EXTRC_REG_RD_HORZ   0x0002      //регистр текущего горизонтального положения (в мм)
#define EXTRC_REG_RD_VEEP   0x0003      //регистр сохраненного в EEPROM вертикального положения (в ипульсах) 
#define EXTRC_REG_RD_HEEP   0x0004      //регистр сохраненного в EEPROM горизонтального положения (в ипульсах)
#define EXTRC_REG_RD_TIMEON 0x0005      //регистр времени работы контроллера
#define EXTRC_REG_RD_MAX    EXTRC_REG_RD_TIMEON + 1     

//*************************************************************************************************
//Адреса регистров записи
//*************************************************************************************************
#define EXTRC_REG_WR_CMD    0x0000      //регистр установки режима работы   
#define EXTRC_REG_WR_VERT   0x0001      //регистр вертикального положения (в мм)
#define EXTRC_REG_WR_HORZ   0x0002      //регистр горизонтального положения (в мм)
#define EXTRC_REG_WR_MAX    EXTRC_REG_WR_HORZ + 1

//*************************************************************************************************
//Маски команд
//*************************************************************************************************
#define EXTRC_CMD_ON        0x0001      //командный режим включить
#define EXTRC_CMD_OFF       0x0002      //командный режим выключить
#define EXTRC_VERT          0x0004      //позиционирование вертикального актуатора в положение из REG_WR_VERT (в мм)
#define EXTRC_HORZ          0x0008      //позиционирование горизонтального актуатора в положение из REG_WR_HORZ (в мм)
#define EXTRC_SEEP          0x0010      //сохранить текущие значения положения в EEPROM
#define EXTRC_REEP          0x0020      //восстановить текущие значения положения из EEPROM
#define EXTRC_BEG_POS       0x0040      //установить трекер в начальное состояние (на восход)
#define EXTRC_PARL_POS      0x0080      //установить трекер в горизонтальное положение (параллельно земли)
#define EXTRC_VERT_VAL      0x0100      //установка текущего положения вертикального актуатора из REG_WR_VERT (без позиционирования)
#define EXTRC_HORZ_VAL      0x0200      //установка текущего положения горизонтального актуатора из REG_WR_HORZ (без позиционирования)
#define EXTRC_STOP          0x1000      //остановка позиционирования трекера
#define EXTRC_RESET         0x8000      //перезапуск контроллера

//*************************************************************************************************
//Маски источника сброса контроллера
//*************************************************************************************************
#define EXTRC_PWR_RES       0x0001      //Power-on Reset
#define EXTRC_EXT_RES       0x0002      //External Reset
#define EXTRC_BRN_RES       0x0004      //Brown-Out Reset
#define EXTRC_WDT_RES       0x0008      //Watchdog Reset

//*************************************************************************************************
//Маски состояния - концевые выключатели актуаторов
//*************************************************************************************************
#define EXT_TERM_VCLOSE     0x0010      //вертикальный верхний, актуатор закрыт
#define EXT_TERM_VOPEN      0x0020      //вертикальный нижний, актуатор открыт
#define EXT_TERM_HCLOSE     0x0040      //горизонтальный левый, актуатор закрыт
#define EXT_TERM_HOPEN      0x0080      //горизонтальный правый, актуатор открыт
#define EXT_TERM_ALL        0x00F0      //общая маска

//*************************************************************************************************
//Маски состояния - солнечный сенсор
//*************************************************************************************************
#define EXT_SOLAR_UP        0x0100      //засвечен верхний датчик сенсора
#define EXT_SOLAR_DN        0x0200      //засвечен нижний датчик сенсора
#define EXT_SOLAR_LF        0x0400      //засвечен левый датчик сенсора
#define EXT_SOLAR_RT        0x0800      //засвечен правый датчик сенсора
#define EXT_SOLAR_ALL       0x0F00      //общая маска

//*************************************************************************************************
//Маски состояния - дополнительные входы управления
//*************************************************************************************************
#define EXT_V24_OK          0x1000      //есть питание после предохранителя
#define EXT_V24_CTRL        0x2000      //есть питание реле привода актуаторов
#define EXT_CMND_MODE       0x4000      //признак включенного внешнего командного режима
#define EXT_WIND_WARNING    0x8000      //сигнал сильного ветра

#endif
