
//*************************************************************************************************
// Определение масок и регистров MODBUS для отслеживания состояния и управления 
// голосовым информатором
//*************************************************************************************************

#ifndef __VOICE_EXT_H
#define __VOICE_EXT_H

//*************************************************************************************************
//Адреса регистров чтения
//*************************************************************************************************
#define EXVOI_REG_RD_STAT       0x0000      //регистр статуса см. ниже "маски ..."
#define EXVOI_REG_RD_VOLUME     0x0001      //регистр уровня громкости
#define EXVOI_REG_RD_MAX        EXVOI_REG_RD_VOLUME + 1

//*************************************************************************************************
//Адреса регистров записи
//*************************************************************************************************
#define EXVOI_REG_WR_CMD        0x0000      //код команды
#define EXVOI_REG_WR_VOLUME     0x0001      //уровень громкости
#define EXVOI_REG_WR_PAR1       0x0002      //параметр 1 (код предварительного сообщения)
#define EXVOI_REG_WR_PAR2       0x0003      //параметр 2 (код информационного сообщения)
#define EXVOI_REG_WR_PAR3       0x0004      //параметр 3 (проценты/значение часов)
#define EXVOI_REG_WR_PAR4       0x0005      //параметр 4 (проценты/значение минут)
#define EXVOI_REG_WR_MAX        EXVOI_REG_WR_PAR4 + 1

//*************************************************************************************************
//Маски команд для голосового информатора
//*************************************************************************************************
#define EXVOI_CMD_PLAY          0x0001      //воспроизвести фрагмент
#define EXVOI_CMD_VOLUME        0x0002      //установить уровень громкости
#define EXVOI_CMD_RESET         0x8000      //перезапуск контроллера

//*************************************************************************************************
//Маски типов цифровых значений
//*************************************************************************************************
#define EXVOI_PAR_DIGITAL       0x1000      //тип параметра - числительное простое
#define EXVOI_PAR_PERCENT       0x2000      //тип параметра - числительное процентное
#define EXVOI_PAR_HOURS         0x4000      //тип параметра - числительное часы
#define EXVOI_PAR_MINUTES       0x8000      //тип параметра - числительное минуты
#define EXVOI_PAR_VALUE         0x0FFF      //маска фактических значений параметра
#define EXVOI_PAR_TYPE          0xF000      //маска типа параметра

//*************************************************************************************************
//Маски источника сброса контроллера
//*************************************************************************************************
#define EXVOI_PWR_RES           0x0001      //Power-on Reset
#define EXVOI_EXT_RES           0x0002      //External Reset
#define EXVOI_BRN_RES           0x0004      //Brown-Out Reset
#define EXVOI_WDT_RES           0x0008      //Watchdog Reset

#endif
